[
  {
    "posting_title": ".Net Developer",
    "posting_url": "https://www.indeed.com/rc/clk?jk=65134f8de11203b0&fccid=04049f8058008f54&vjs=3",
    "posting_text": "Description:\nDevelops new, custom web applications using modern web development tools, technologies and\nframeworks\nProvides maintenance and support services on legacy web applications\nPerforms all aspects of the software development lifecycle (SDLC)\nAble to work with minimal supervision to deliver a quality software product on time and on budget\nAble to work independently and with a team\nKnack for writing clean, readable and easily maintainable code.\nPossesses clear, concise verbal and written communication skills\nPossesses a high regard for customer satisfaction\nMaintains a positive, can-do attitude, excellent reliability and attendance habits\nReceives constructive feedback constructively\nShould have excellent documentation skills.\nTechnical Skills\nExpert level Visual Studio .NET and C# experience\nExpert level JavaScript experience\nExtensive, recent experience with all of the following: Angular JS, TypeScript, NodeJS, ASP.NET 4.0,\nMVC, MVVM, Bootstrap, SQL server reporting services, SQL server integration services\nKnowledge of and experience with SOAP and REST web services, including experience with\nMicrosoft WCF\nExperience with SharePoint Server 2013\nExperience with Team foundation server 2018\nAdditional Skills Considered a Plus\nExperience with Atlassian tools (JIRA)\nExperience in training other developers with latest technology.",
    "location": "Sacramento, CA",
    "company": "\nWest Advanced Technologies (WATI)"
  },
  {
    "posting_title": "Web Applications Developer: Sacramento County – Department of Child Support Services (DCSS)",
    "posting_url": "https://www.indeed.com/rc/clk?jk=4820922b52519293&fccid=04049f8058008f54&vjs=3",
    "posting_text": "Required Skills:\n\nDevelop Microsoft ASP.NET, and ASP.NET MVC web applications using C#.\nUse Visual Studio for development of .NET projects, and Visual Studio Code for Angular projects.\nWork within the project team to complete system analysis, application design and to identify and specify complex business requirements.\nExpert knowledge of HTML/HTML5, JavaScript, JSON, and CSS.\nDevelopment of RESTful web services using the Microsoft Web API framework with C#.\nDevelop web applications that interface to RDMS using ADO.NET and Entity Framework.\nParticipate in a team development environment using the TFS source control system.\nExperience working in an agile development environment.\n\nDesired Skills:\n\nExperience with technologies such as ASP.NET Core MVC, Angular and Bootstrap.\nDevelop single-page-applications using Angular version 6, 7, or 8.\nT-SQL for SQL Server and report writing experience, preferably with SSRS\nComfortable working with Observables in JavaScript.\nApplication Development Lifecycle knowledge and experience.\nJIRA tools and API knowledge or experience.\nElectronic document management concepts, e.g. imaging, e-signatures.\nBuilding web-based UIs with cross-browser compatibility (IE and Chrome).\nDocumentation of system support information.\nBasic understanding of networking principles.\nAbility to analyze system resource usage and constraints.\nRecognizes problems, develops recommendations and solutions within assigned specialty.\nWorks independently and follows through on assignments.",
    "location": "Sacramento, CA",
    "company": "\nWest Advanced Technologies (WATI)"
  },
  {
    "posting_title": ".Net Developer",
    "posting_url": "https://www.indeed.com/rc/clk?jk=be279e1eb30037dd&fccid=135e45f524c4106a&vjs=3",
    "posting_text": "Required Skills:\nMinimum 5 years of C#, VB.NET, ASP.NET, ADO.NET experience\nMinimum 5 years of Visual Studio 2012 experience\nMinimum 5 years of MS SQL Server 2012/2014/2016 experience\n\nDesired Skills:\nVisual Basic for Applications (VBA), Windows Batch Scripting experience\nOracle database\n\nPosition Requirements:\nDesign and develop software solutions using the Visual Studio development environment\nComplete ALL stages of SDLC including analysis, requirements determination, effort estimation, design, coding, testing, and developing all written technical design, user and end deliverable documentation\nExcellent verbal communication skills, ability to work cooperatively with client and team members, provide leadership to ensure successful project execution\nWork in a team environment to develop, test, and deploy software changes\nDevelopment experience with Health Care Claims processing systems (medical or dental) preferred\n\n\nEducation/Experience:\nA technical Bachelor’s Degree or equivalent experience",
    "location": "Folsom, CA 95630",
    "company": "\nStanfield Systems, Inc."
  },
  {
    "posting_title": "Microservices /.NET Full-Stack Developer",
    "posting_url": "https://www.indeed.com/rc/clk?jk=5e9b14904cc56bee&fccid=53b273c5542237e5&vjs=3",
    "posting_text": "Estrada Consulting, Inc. is currently seeking two expert Lead Full-Stack Microservices / .NET Developers for a project located in Sacramento, CA. Candidate will interview in-person.\n\n\nCandidate will need to be local or within an acceptable commute to work on-site M-F.\n\nMinimum Qualifications and Desired Qualifications:\nAt least 10 years of verifiable U.S. experience developing enterprise applications based upon Microsoft ASP.NET MVC, Entity Framework, and LINQ. Must have at least 3 years performing in a Lead capacity on large-scale enterprise software development project.\nAt least 10 years of Front-end development using JavaScript, jQuery, HTML5 and CSS.\nAt least 5-7 years of Back-end development in C# using ASP.NET MVC.\nMust have documented experience in Microservices either AWS or Azure: demonstrated experience building Microservices, patterns etc.\nAt least 3 years of Database development using MS SQL, including implementing stored procedures, views and managing table schemas and relationships. Proficiency with multi-table joins.\nAt least 5-7 years\nExperience using Visual Studio 2015 or greater, Microsoft SQL Server 2014 or greater, and Microsoft Team Foundation Server 2013 (or similar source control systems).\nC#, Razor, JavaScript, jQuery, XML, HTML, CSS, T-SQL.\nVerbal and written communication skills need be top notch to effectively communicate with team, project manager, and stakeholders in a diverse team environment.\nObject-oriented programming concepts.\nMulti-tier/multi-layer software architecture patterns.\nProfessional experience, and advanced knowledge and skill, in all phases of the software development life cycle (SDLC), including\nAnalysis and documenting business requirements\nDevelopment of technical documentation such as ERDs, DFDs, etc.\nExperienced in Agile development and teams.\n\nDesirable Experience:\nPublic Sector is highly preferred must not mandatory\nMicrosoft Certifications\n\nAbout ECI - Sacramento\n\nEstrada Consulting, Inc. (ECI) is a delivering technology-enabled services and solutions to clients all over the USA and British Columbia. We provide system integration, custom application development, project management, custom reporting solutions and consulting services to mid-size and large enterprises in all major industries. The Company headquarters in Sacramento, California, was established in year 2000. Visit http://www.estradaci.com/ to learn about our projects, managed services, awards and certifications delivering value for a range of businesses and government agencies.",
    "location": "Sacramento, CA",
    "company": "\nECI - Sacramento"
  },
  {
    "posting_title": "Full Stack Developer – Contract to Hire",
    "posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DPtnWd5c3HSXcHE7Q9oJFHp5RQto9btUDg0qVxvc0iqj-fTOFvfyy1ASDi6wx1MLRvbNcjNjhFL6xYmGl1hXaqoTCCYXZSNG41ZXKE9WPbIY4PIrgImVp0WdiwLK0CFTQxTPiGrLW2mJdn1XxF6a-3fJHy-egYpPrNgWT6rR9Lrik36ecFISB2vs-bwS24jQq9ODngbMI33le0nH-mX4JSkVeLsfEZ-eGvhViFogDg8NHUM0FqtKXl5mQVv02RMg6nZhXoV8k7XcZNsK2PyawYSoSmxQoFpcTdr_iIYtTguM8JRFgFipEqPi3LJPks4QxNp3QF17qWSeKIqwKP_GLBbpV09k0HvmIpHkfqpO68Dklbr6C8_omR-2ENKPI64arZ0lPy8rCkJrk0ZQrFimAlcMEl9fRR9bXYdhxzANL6cYysCJDunhLNxFy5SazbPtoIQiGy-l8CKzY8PUOzdpJuHeq5eTStbnGCe70uvbQYcnxKfBdHNDkohY7-PcH7TQs5Iy-58YoZ_z74CUTHsxpDUtUVegujED5A_XFttDZlHOiwX6Yvb6J6y45WuostYu7xBjjTuL6qiEAfGUCwOOr9nDypKUovRskZWkjigqOkXtZhDlVQxRd3BIzHINysDD-bB6wTpC9MUg==&p=2&fvj=0&vjs=3",
    "posting_text": "Full Stack Developer – Contract to Hire\nThis position is a contract to hire role with a local Minnesota based company.\nCandidates must be local to the Minneapolis / St. Paul area.\n\n\nOur client is a member owner network of over 500 members. Their goal is to help their members grow their businesses by providing classroom training, mentoring, online tools, and strategic partnerships.\nThe big task\nWe are looking for a full stack developer who can help us transform our digital presence.\nKey sub tasks\nCreate custom applications.\nMaintain our websites.\nConduct security assessments.\nBuild out and customize new platforms.\nSkills and experience\nBS in computer science or related field(preferred).\n5+ years professional experience building web-based applications.\nExperience with front-end frameworks (React, Angular, Vue.js).\nStrong C#, .Net MVC, EF and/or LAMP stack.\nExperience with task management software (e.g. Atlassian Jira).\nExperience with version control systems (e.g. ClearCase, Git).\nKnowledge of desktop applications such as word processing, spreadsheet and database programs.\nClear understanding of best practices related to defensive coding/security.\nActive participation in scrum team with a focus on designing and delivering scalable, modular, responsive applications.\n\nWhat we offer\nBase Salary plus performance bonuses.\nCompetitive benefits package that includes health and dental insurance, paid time off and tuition reimbursement.\nHome service reimbursement.\nGym membership and cell phone reimbursement.\n401k Plan.\nThe opportunity to work with A players who treat each other with respect and integrity.\nA family. This is last on the list because it’s most important. We care about our team and expect you to bring that same caring when you join. We do a lot more than just work together. You’ll come to love our company outings, and you’ll build life-long friendships.\n\n\n** Candidates must be LOCAL to the Minneapolis / St. Paul area. Non-local candidates will not receive a reply **\n** No recruiters or placement firms - no response will be given **",
    "location": "United States",
    "company": "\n\nIntertech, Inc"
  },
  {
    "posting_title": "Sr. Full Stack .Net Developer",
    "posting_url": "https://www.indeed.com/company/Averro/jobs/Senior-Full-Stack-Net-Developer-d7c7dc6fbb3b68ae?fccid=acacab80642863ca&vjs=3",
    "posting_text": "*Ability to build web applications including graphic elements, site organization, navigation layout, development, usability of web pages.In depth knowledge of web application development with Angular, HTML5 & CSS3 and Typescript. (other modern frontend JavaScript frameworks such as Ember, Backbone or React can substitute for Angular)Expert knowledge of .NET Core, .NET MVC application development including web servicesStrong foundational understanding of the C# language including usage of Asynchronous programming and Object-Oriented conceptsExperience working with Git or other version control systemsExpertise with SQL and SQL Server databases and Entity FrameworkUnderstanding of unit testing and a desire to write tests and unit testable codeExperience with building microservicesExperience with accessibility standardsTop 3 skills: Angular, .NET, C#Bachelor’s degree – preferably in Computer Science or a similar area; mastery of development skills and demonstrable work experience may substitute for the degree requirementEXAMPLES OF WORK RESPONSIBILITIESDevelop Front End components per UI specification that meet business and technical requirements. This will include working with Business Analysts, Subject Matter Experts (SMEs) and Testers to form a common understanding of the implementation strategy. Work directly with the UI/UX designer to ensure screens match the design.Develop API Components and application tier components including creation or editing of database tables and columns as well as creation or updates to the associated Entity Framework queries, and application endpoints.Create unit tests using xUnit to test all newly developed application components.Perform peer code reviews for the developers on the team as part of the Git pull request process. Peer and architecture reviews will be required, and all application code will be subject to the technical design standards as set by the project requirements and architecture guide.Effective communication style; serve as a collaborative, cooperative and contributing member of the team.Job Type: ContractContract Length:1 yearContract Renewal:LikelyFull Time Opportunity:NoWork Location:One location",
    "location": "Sacramento, CA",
    "company": "\n\nAverro"
  },
  {
    "posting_title": "C# .Net Developer",
    "posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AQtvX0ExgMUjbitSkLwKCSA3LQo0HkUSQFdaWGSztDfBTjAekFzs506_S9i1Jw9vt4lL52X5-x6i0AOIx9YbMn3VSLABaDsRw5jrwFBtlvJr6k25afiqFbh-RDbTQ6Al7rmOI-zJl2mHTSht4gmH4dzWOjSbJG4Mc2lfA5ZjXTByxgwTYmTzd5Z1FX-NDJsIiu18Ro0gUsozrxGlrR2QImhTW7i7icrUU6C597bXGVm7Oyx1UnrWCd-VAqTyG6nlOyLgKX7tgJFbbGNPMLzsOiMW_tragb8r9Nip22lGYUAVdJzQFrvF8bEI0ixC2vgvC4vYyrS9WUZrcfuTqNApIcQEqZkXgV30temg-AsxFAedtd140SgEEHzHRPHQxtqZZXfv4dgkPTSA42jmY1OKRCPMFwVEuvkuU1BQ8_to_q9CbnuqTE4KIorNSH7JUiTnDJ_0oaaNd7dcfDKhUENZsAjJNljB5T9CU=&p=0&fvj=1&vjs=3",
    "posting_text": "About the company: For over 20 years our company has handled the photography and videography of automotive dealership's vehicles for sale on the internet. Our company has several ambitious projects and is expanding to dealerships nationwide with our “self-service” web interface. See our website DealerVision.com for more information about what services our company offers.About the job: We are looking for an experienced and talented C#/.NET developer to join our team in the Granite Bay, CA area. Must be willing and able to work full time, local candidates preferred, but open to remote workers in the same time zone (PST).Principals only, no staffing agencies or software solutions companies.Duties & Responsibilities: Build and enhance multiple database-driven web sites and backend services.Work with staff to design and implement new projects, features, and bug fixes.Develop, debug, and refactor with ASP.NET, C#, MSSQL, Javascript, etc.Qualifications and Skills -- Required: C# and ASP.NETSQL Server, T-SQL, stored proceduresEntity FrameworkProficient in the fundamentals: HTML, JavaScript, CSS, AJAXWorking knowledge of Microsoft Visual StudioGood understanding of OOP, and design patterns (SOLID)Comfortable working with source control repositories (SVN, VSTS/Azure DevOps, git, etc)Team player with excellent interpersonal, verbal, and written communication skillsSelf-starter, driven to deliver quality results quicklyAbility to handle simultaneous projectsDesire and willingness to learn new technologies quicklyOrganized and attentive to detailsStrong work ethicQualifications and Skills -- Preferred: Amazon AWS - S3, EC2, CloudFront, SQS, RDS, Lambda, etc.ASP.NET WebAPIGoogle AnalyticJob Type: Full-timeWork Location:One location",
    "location": "Roseville, CA",
    "company": "\nDealerVision.com"
  },
  {
    "posting_title": "GIS Application Developer",
    "posting_url": "https://www.indeed.com/company/Linda-Rogers-and-Associates/jobs/GIS-Application-Developer-8a110bdeef883c57?fccid=233df919551ba36e&vjs=3",
    "posting_text": "This position will help the team catch up on back log of projects and other application related support tasks. The successful candidate will perform a variety of tasks such as:Work with GIS Web Developers to maintain or create application code using javascript and ArcGIS Services with technologies like C#, CSS, AJAX, Dojo, ArcGIS jsAPI, Google Maps, python and ASP.NET.Experience with Javascript UI frameworks - in particular Bootstrap, also Node, Knockout, Angular, Backbone  * Strong UX skills, particularly for mobileExperience restructuring large scale Javascript applicationsExperience with creating search-centric applications – using SolR, ElasticSearchGIS/Spatial development experience – more than just address points on Google Maps. Use of Google Maps API, ESRI API  * Experience with continuous integration and continuous deployment environmentsExperience with cloud-based application development, deployment and operations  * Work with other division developers to promote geospatial solutions and embed GIS functionality improving customer workflows where it makes sense.This position will be full-time onsite M-F in Sacramento.Job Types: Full-time, ContractSalary: $50.00 to $60.00 /hourEducation:Bachelor's (Preferred)Location:Sacramento, CA 95814 (Required)Work authorization:United States (Required)Contract Length:More than 1 yearFull Time Opportunity:NoWork Location:One locationBenefits:Health insuranceVisa Sponsorship Potentially Available:No: Not providing sponsorship for this jobThis Job Is Ideal for Someone Who Is:People-oriented -- enjoys interacting with people and working on group projectsAchievement-oriented -- enjoys taking on challenges, even if they might failInnovative -- prefers working in unconventional ways or on tasks that require creativitySchedule::Monday to Friday",
    "location": "Sacramento, CA 95814 ",
    "company": "\nLinda Rogers and Associates"
  },
  {
    "posting_title": ".NET Developer with AWS",
    "posting_url": "https://www.indeed.com/company/Key-Business-Solutions,-Inc./jobs/Net-Developer-Aws-6105daeb88b72084?fccid=ded3d5dca58318b6&vjs=3",
    "posting_text": "Job Summary.NET Developer with AWSSacramento, CADuration: Long termRequired:Web developer with at least 5 years of experience.Working experience of Angular 2.0 and above, HTML5, JavaScriptC#.net and ADO.net with framework 4.7 and above.Experience developing web APIs (RESTful services)Working knowledge of Amazon Web Services (AWS) is a must.Knowledge of Azure would be an advantage.Knowledge of SQL Server.Net experience that includes design, development, testing, maintenance and production support using SDLC process and Agile methodologies.Good written and oral communication skillsJob Type: ContractExperience:.NET: 2 years (Preferred)mvc: 1 year (Preferred)Contract Renewal:Likely",
    "location": "Sacramento, CA 95834 ",
    "company": "\n\nKey Business Solutions, Inc."
  },
  {
    "posting_title": "Software Developer",
    "posting_url": "https://www.indeed.com/rc/clk?jk=3ea3f00c747f57ea&fccid=adca44f3b9008cc2&vjs=3",
    "posting_text": "Who we are:\nSince 1998, SambaSafety® has been the pioneer and leading provider of driver risk management software in North America. Our mission is to guide our customers including employers, fleet managers and insurance providers to make the right decision at the right time. By collecting, correlating and analyzing motor vehicle records (MVRs) and other data sources, we identify driver risk and enable our customers to modify their drivers' behavior, reduce accidents, ensure compliance, and lower costs — ultimately improving driver and community safety.\nWhat you'll do\nWe are looking for a passionate Software Developer to think critically, collaborate with product managers, and guide other engineers while designing, building, and installing software solutions. The successful candidate will be able to build high-quality, innovative and fully performing software in compliance with coding and technical design standards.\n3+ years' experience in software development\nWrite well designed, testable, efficient code\nProduce specifications and determine operational feasibility\nIntegrate software components into a fully functional software system\nDevelop software verification plans and quality assurance procedures\nDocument and maintain software functionality\nTailor and deploy software tools, processes and metrics\nServe as a subject matter expert\nComply with project plans and industry standards\n How to step on the accelerator\nHands on experience in designing interactive applications\nAbility to develop software in C, C++, C# or other selected languages\nExcellent knowledge of Relational Databases, SQL and ORM technologies like Hibernate\nExperience in AWS or comparable cloud technologies\nExtensive involvement building SOAP-based and REST full web services utilizing WCF/Web API\nExperience in developing web applications using at least one popular web framework (ASP.NET MVC, Entity Framework, and LINQ)\nExperience with test-driven development\nMastery in software engineering tools\nAbility to document requirements and specifications\nFamiliarity with software development methodology and release processes\nExperience working with multi-site and/or offshore teams or team members\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n\nBenefits and Perks:\nUnlimited paid time off\nStocked beer fridge (Denver office)*\nHealthy snacks provided\nGenerous insurance policies and amazing benefits\nTuition reimbursement\nCareer Growth\nMoney for fitness programs\nAwesome Culture\nOnsite Fitness Gym and great access to trails\nWe love to celebrate birthdays!\nKitchen stocked daily with tasty snacks and drinks\nGarage parking for Employees*\nMatching 401kAvailable in certain office locations\nSambaSafety provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, gender identity, and expression or genetics.\nOcTAKOvlrr",
    "location": "Rancho Cordova, CA",
    "company": "\n\nSambasafety"
  },
  {
    "posting_title": "Entry Level - Software Developer",
    "posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0ChdE_-3s9UeG5xYsqO3th9AddXeBq2OieSfAM8evhI-PZ76-Buf7EcnCv0gKKLndR0YEV2kTxuAD_VKH6HEbZFGsVNkpiitjOp_daSiXpE3Pd_X3qe-bekUwRlgzVovAcCBt0z5yUU5xFBeE38vP8NN1cwM2zQW5_7-qCme8Eqijo2i9JWAHEP0vpapj3Ey2sgchXNyUqsenlSEJR2zRVw6-S_gf-gqTvh9XbzFBr3OoqVttlpAHo4JpKW96ncTb6PkHspFMAue8IQUb_hTqJA8TXl0kWPanyMzGUGALbYFUhb3T20qU9ZrPAzT5ofqE7V7pFlO-4AYig05TaSOXeDJGDk4ODPN2EODpjvsDFLM4B5ea8QDPb8dnnEzmxSNCtcntGTNcrisWQBC2OMYNNHeS05pucMxnaLxwKh37PkgZhxvY495r_DaihMTONLu0YDJPej5PPfQSTUf3UMGm4YJXVgixCNrBYxs66urZew0Q==&p=1&fvj=1&vjs=3",
    "posting_text": "Smoothstack—a tech talent incubator—is one of the most rapidly growing disruptive enterprises in the IT industry in the US.We are looking for developers who want to make a career engaging in challenging projects on futuristic technology, software development, implementing software solutions, developing apps and much more within a variety of sectors such as financial, health care, energy and federal.New college graduates are welcome to apply. We have multiple openings in and around Washington D.C. (Metro area) and no prior work experience is required. We will provide on the job training after you are hired.Basic QualificationsExcitement and eagerness to learn new technologyPassion for IT development and desire to gain in-depth knowledgeBachelor’s degree or minor in any of the following: Computer Science, Engineering, Statistics, Mathematics or Economics or equivalent training or course work experienceBasic knowledge of Java, C#, .Net, Python or similar programming languagesInterest in web programming and Object-Oriented designAdvantages of SmoothstackPay Package - $55,000 onwardRelocation assistance providedHealth/Medical Benefits401 KIndustry CertificationsMentoring ProgramOpportunity to work at Fortune 500 companiesWe are proud of our diverse environment, EOE, MFDV.Principles only. Recruiters please do not contact this job poster.Do NOT contact us with unsolicited services or offer.Job Type: Full-timeSalary: $55,000.00 /yearExperience:relevant: 1 year (Preferred)Education:Bachelor's (Preferred)Work Location:One locationMultiple locationsBenefits:Paid time offRelocation assistanceProfessional development assistanceHealth insuranceThis Job Is:Open to applicants who do not have a college diplomaOpen to applicants who do not have a high school diploma/GEDA job for which military experienced candidates are encouraged to applySchedule::Monday to Friday",
    "location": "United States",
    "company": "\nSmoothstack"
  },
  {
    "posting_title": "Senior SQL Developer",
    "posting_url": "https://www.indeed.com/company/BoozDNA-LLC/jobs/Senior-SQL-Developer-5a26ffcaacee30ad?fccid=19721394375d7bfa&vjs=3",
    "posting_text": "Role:  Senior SQL DeveloperLocation:  Sacramento, CADuration:  24 months (extendable by another 12 months)Mandatory Technical RequirementAt least eight (8) years of experience comprehending and developing complex SQL queries; developing detailed SQL reporting specifications, analyzing, validating, and / or reconciling data from heterogeneous data sources such as mainframe, MS SQL Server, MS Access databases, csv files, text files.At least eight (8) years of experience designing, developing, debugging and supporting complex data validation processes (including stored procedures, tables, user defined functions, views, indexes, relational database models) using various tools and technologies including SSRS, T-SQL and SQL Server technology. This experience must include full-time experience in developing reports and writing code from data model, dataflow diagram and technical design specifications.At least six (6) years of experience performing data migration efforts including analysis, cleansing, conversion, verification and validation to ensure data quality and consistency.At least five (5) years of experience analyzing functional and nonfunctional data conversion requirements, data conversion mapping code and transformation rules for translating them into technical requirements for data quality assurance purposes including but not limited to the performing validation using reconciliation methods of checking record counts between source and target systems.Desirable Technical RequirementsAt least five (5) years of experience in developing SQL Reports as part of the data validation strategy for a Pension Administration System.At least five (5) years of experience with Microsoft.Net framework using languages such as C# and VB.Net to write utilities for validating data as well as source code management software such as TFS (Microsoft Team Foundation Server).At least five (5) years of experience in validating data being converted from legacy mainframe applications to SQL Server.At least five (5) years of experience in producing the following documents: data verification & validation requirements, data validation strategy, data validation test cases and data validation reports.At least two (2) years of experience handling Database Administrator (DBA) tasks using MS SQL Server.A four-year college degree (Bachelor) in Computer Science, Computer Engineering, or related fields from a government accredited/sanctioned college or university.Job Type: ContractContract Renewal:PossibleWork Location:One location",
    "location": "Sacramento, CA",
    "company": "\nBoozDNA LLC"
  }
]